import numpy as np

data = np.array(
    [
        9.3088,
        9.2448,
        9.36,
        9.2992,
        9.264,
        9.216,
        9.1776,
        9.232,
        9.1712,
        9.2512,
        9.4816,
        9.5296,
        9.4432,
        9.4816,
        9.4848,
        9.2544,
        9.2672,
        9.2192,
        9.1392,
        9.0976,
        9.376,
        9.1744,
        9.36,
        9.344,
        9.3728,
        9.2512,
        9.3408,
        9.2192,
        9.2928,
        9.3088,
    ]
)
mean = np.mean(data)
std_dev = np.std(data, ddof=0)  # 使用 N 作为除数，无偏差标准差则使用 ddof=1

print(f"平均值 (Mean): {mean:.4f}")
print(f"标准差 (Standard Deviation): {std_dev:.4f}")
